Revit 2027 API
PlanTopology Methods
The PlanTopology type exposes the following members.
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRoomIds | Retrieves room ElementIds of the PlanTopology in the last phase.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PlanTopology Class
Autodesk.Revit.DB Namespace